LaloAlvarez-e/MSP430F169/MSP430F169_DriverLib/DriverLib/ADC12/Peripheral/RegisterDefines/Header/ADC12_RegisterDefines_CTL0.h
/**
 *
 * @file ADC12_RegisterDefines_CTL0.h
 * @copyright
 * @verbatim InDeviceMex 2021 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 6 feb. 2022 @endverbatim
 *
 * @author
 * @verbatim InDeviceMex @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 6 feb. 2022     InDeviceMex    1.0         initial Version@endverbatim
 */

#ifndef ADC12_PERIPHERAL_REGISTERDEFINES_HEADER_ADC12_REGISTERDEFINES_CTL0_H_
#define ADC12_PERIPHERAL_REGISTERDEFINES_HEADER_ADC12_REGISTERDEFINES_CTL0_H_

#include "DriverLib/MCU/Header/MCU_Common.h"

/******************************************************************************************
 ************************************ 1 CTL0 *********************************************
 ******************************************************************************************/
/*-----------*/
#define ADC12_CTL0_R_SC_BIT ((uint16_t) 0U)

#define ADC12_CTL0_SC_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_SC_NA ((uint16_t) 0x00U)
#define ADC12_CTL0_SC_START ((uint16_t) 0x01U)

#define ADC12_CTL0_R_SC_MASK (ADC12_CTL0_SC_MASK << ADC12_CTL0_R_SC_BIT)
#define ADC12_CTL0_R_SC_NA (ADC12_CTL0_SC_NA << ADC12_CTL0_R_SC_BIT)
#define ADC12_CTL0_R_SC_START (ADC12_CTL0_SC_START << ADC12_CTL0_R_SC_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_ENC_BIT ((uint16_t) 1U)

#define ADC12_CTL0_ENC_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_ENC_DIS ((uint16_t) 0x00U)
#define ADC12_CTL0_ENC_ENA ((uint16_t) 0x01U)

#define ADC12_CTL0_R_ENC_MASK (ADC12_CTL0_ENC_MASK << ADC12_CTL0_R_ENC_BIT)
#define ADC12_CTL0_R_ENC_DIS (ADC12_CTL0_ENC_DIS << ADC12_CTL0_R_ENC_BIT)
#define ADC12_CTL0_R_ENC_ENA (ADC12_CTL0_ENC_ENA << ADC12_CTL0_R_ENC_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_TOVIE_BIT ((uint16_t) 2U)

#define ADC12_CTL0_TOVIE_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_TOVIE_DIS ((uint16_t) 0x00U)
#define ADC12_CTL0_TOVIE_ENA ((uint16_t) 0x01U)

#define ADC12_CTL0_R_TOVIE_MASK (ADC12_CTL0_TOVIE_MASK << ADC12_CTL0_R_TOVIE_BIT)
#define ADC12_CTL0_R_TOVIE_DIS (ADC12_CTL0_TOVIE_DIS << ADC12_CTL0_R_TOVIE_BIT)
#define ADC12_CTL0_R_TOVIE_ENA (ADC12_CTL0_TOVIE_ENA << ADC12_CTL0_R_TOVIE_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_OVIE_BIT ((uint16_t) 3U)

#define ADC12_CTL0_OVIE_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_OVIE_DIS ((uint16_t) 0x00U)
#define ADC12_CTL0_OVIE_ENA ((uint16_t) 0x01U)

#define ADC12_CTL0_R_OVIE_MASK (ADC12_CTL0_OVIE_MASK << ADC12_CTL0_R_OVIE_BIT)
#define ADC12_CTL0_R_OVIE_DIS (ADC12_CTL0_OVIE_DIS << ADC12_CTL0_R_OVIE_BIT)
#define ADC12_CTL0_R_OVIE_ENA (ADC12_CTL0_OVIE_ENA << ADC12_CTL0_R_OVIE_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_ON_BIT ((uint16_t) 4U)

#define ADC12_CTL0_ON_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_ON_OFF ((uint16_t) 0x00U)
#define ADC12_CTL0_ON_ON ((uint16_t) 0x01U)

#define ADC12_CTL0_R_ON_MASK (ADC12_CTL0_ON_MASK << ADC12_CTL0_R_ON_BIT)
#define ADC12_CTL0_R_ON_OFF (ADC12_CTL0_ON_OFF << ADC12_CTL0_R_ON_BIT)
#define ADC12_CTL0_R_ON_ON (ADC12_CTL0_ON_ON << ADC12_CTL0_R_ON_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_REFON_BIT ((uint16_t) 5U)

#define ADC12_CTL0_REFON_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_REFON_OFF ((uint16_t) 0x00U)
#define ADC12_CTL0_REFON_ON ((uint16_t) 0x01U)

#define ADC12_CTL0_R_REFON_MASK (ADC12_CTL0_REFON_MASK << ADC12_CTL0_R_REFON_BIT)
#define ADC12_CTL0_R_REFON_OFF (ADC12_CTL0_REFON_OFF << ADC12_CTL0_R_REFON_BIT)
#define ADC12_CTL0_R_REFON_ON (ADC12_CTL0_REFON_ON << ADC12_CTL0_R_REFON_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_REF2_5V_BIT ((uint16_t) 6U)

#define ADC12_CTL0_REF2_5V_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_REF2_5V_1_5V ((uint16_t) 0x00U)
#define ADC12_CTL0_REF2_5V_2_5V ((uint16_t) 0x01U)

#define ADC12_CTL0_R_REF2_5V_MASK (ADC12_CTL0_REF2_5V_MASK << ADC12_CTL0_R_REF2_5V_BIT)
#define ADC12_CTL0_R_REF2_5V_1_5V (ADC12_CTL0_REF2_5V_1_5V << ADC12_CTL0_R_REF2_5V_BIT)
#define ADC12_CTL0_R_REF2_5V_2_5V (ADC12_CTL0_REF2_5V_2_5V << ADC12_CTL0_R_REF2_5V_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_MSC_BIT ((uint16_t) 7U)

#define ADC12_CTL0_MSC_MASK ((uint16_t) 0x01U)
#define ADC12_CTL0_MSC_SINGLE ((uint16_t) 0x00U)
#define ADC12_CTL0_MSC_MULTIPLE ((uint16_t) 0x01U)

#define ADC12_CTL0_R_MSC_MASK (ADC12_CTL0_MSC_MASK << ADC12_CTL0_R_MSC_BIT)
#define ADC12_CTL0_R_MSC_SINGLE (ADC12_CTL0_MSC_SINGLE << ADC12_CTL0_R_MSC_BIT)
#define ADC12_CTL0_R_MSC_MULTIPLE (ADC12_CTL0_MSC_MULTIPLE << ADC12_CTL0_R_MSC_BIT)
/*-----------*/


#define ADC12_CTL0_SHT_MASK ((uint16_t) 0x0FU)
#define ADC12_CTL0_SHT_4 ((uint16_t) 0x00U)
#define ADC12_CTL0_SHT_8 ((uint16_t) 0x01U)
#define ADC12_CTL0_SHT_16 ((uint16_t) 0x02U)
#define ADC12_CTL0_SHT_32 ((uint16_t) 0x03U)
#define ADC12_CTL0_SHT_64 ((uint16_t) 0x04U)
#define ADC12_CTL0_SHT_96 ((uint16_t) 0x05U)
#define ADC12_CTL0_SHT_128 ((uint16_t) 0x06U)
#define ADC12_CTL0_SHT_192 ((uint16_t) 0x07U)
#define ADC12_CTL0_SHT_256 ((uint16_t) 0x08U)
#define ADC12_CTL0_SHT_384 ((uint16_t) 0x09U)
#define ADC12_CTL0_SHT_512 ((uint16_t) 0x0AU)
#define ADC12_CTL0_SHT_768 ((uint16_t) 0x0BU)
#define ADC12_CTL0_SHT_1024 ((uint16_t) 0x0CU)

/*-----------*/
#define ADC12_CTL0_R_SHT0_BIT ((uint16_t) 8U)

#define ADC12_CTL0_SHT0_MASK (ADC12_CTL0_SHT_MASK)
#define ADC12_CTL0_SHT0_4 (ADC12_CTL0_SHT_4)
#define ADC12_CTL0_SHT0_8 (ADC12_CTL0_SHT_8)
#define ADC12_CTL0_SHT0_16 (ADC12_CTL0_SHT_16)
#define ADC12_CTL0_SHT0_32 (ADC12_CTL0_SHT_32)
#define ADC12_CTL0_SHT0_64 (ADC12_CTL0_SHT_64)
#define ADC12_CTL0_SHT0_96 (ADC12_CTL0_SHT_96)
#define ADC12_CTL0_SHT0_128 (ADC12_CTL0_SHT_128)
#define ADC12_CTL0_SHT0_192 (ADC12_CTL0_SHT_192)
#define ADC12_CTL0_SHT0_256 (ADC12_CTL0_SHT_256)
#define ADC12_CTL0_SHT0_384 (ADC12_CTL0_SHT_384)
#define ADC12_CTL0_SHT0_512 (ADC12_CTL0_SHT_512)
#define ADC12_CTL0_SHT0_768 (ADC12_CTL0_SHT_768)
#define ADC12_CTL0_SHT0_1024 (ADC12_CTL0_SHT_1024)

#define ADC12_CTL0_R_SHT0_MASK (ADC12_CTL0_SHT0_MASK << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_4 (ADC12_CTL0_SHT0_4 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_8 (ADC12_CTL0_SHT0_8 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_16 (ADC12_CTL0_SHT0_16 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_32 (ADC12_CTL0_SHT0_32 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_64 (ADC12_CTL0_SHT0_64 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_96 (ADC12_CTL0_SHT0_96 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_128 (ADC12_CTL0_SHT0_128 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_192 (ADC12_CTL0_SHT0_192 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_256 (ADC12_CTL0_SHT0_256 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_384 (ADC12_CTL0_SHT0_384 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_512 (ADC12_CTL0_SHT0_512 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_768 (ADC12_CTL0_SHT0_768 << ADC12_CTL0_R_SHT0_BIT)
#define ADC12_CTL0_R_SHT0_1024 (ADC12_CTL0_SHT0_1024 << ADC12_CTL0_R_SHT0_BIT)
/*-----------*/

/*-----------*/
#define ADC12_CTL0_R_SHT1_BIT ((uint16_t) 12U)

#define ADC12_CTL0_SHT1_MASK (ADC12_CTL0_SHT_MASK)
#define ADC12_CTL0_SHT1_4 (ADC12_CTL0_SHT_4)
#define ADC12_CTL0_SHT1_8 (ADC12_CTL0_SHT_8)
#define ADC12_CTL0_SHT1_16 (ADC12_CTL0_SHT_16)
#define ADC12_CTL0_SHT1_32 (ADC12_CTL0_SHT_32)
#define ADC12_CTL0_SHT1_64 (ADC12_CTL0_SHT_64)
#define ADC12_CTL0_SHT1_96 (ADC12_CTL0_SHT_96)
#define ADC12_CTL0_SHT1_128 (ADC12_CTL0_SHT_128)
#define ADC12_CTL0_SHT1_192 (ADC12_CTL0_SHT_192)
#define ADC12_CTL0_SHT1_256 (ADC12_CTL0_SHT_256)
#define ADC12_CTL0_SHT1_384 (ADC12_CTL0_SHT_384)
#define ADC12_CTL0_SHT1_512 (ADC12_CTL0_SHT_512)
#define ADC12_CTL0_SHT1_768 (ADC12_CTL0_SHT_768)
#define ADC12_CTL0_SHT1_1024 (ADC12_CTL0_SHT_1024)

#define ADC12_CTL0_R_SHT1_MASK (ADC12_CTL0_SHT1_MASK << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_4 (ADC12_CTL0_SHT1_4 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_8 (ADC12_CTL0_SHT1_8 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_16 (ADC12_CTL0_SHT1_16 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_32 (ADC12_CTL0_SHT1_32 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_64 (ADC12_CTL0_SHT1_64 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_96 (ADC12_CTL0_SHT1_96 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_128 (ADC12_CTL0_SHT1_128 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_192 (ADC12_CTL0_SHT1_192 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_256 (ADC12_CTL0_SHT1_256 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_384 (ADC12_CTL0_SHT1_384 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_512 (ADC12_CTL0_SHT1_512 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_768 (ADC12_CTL0_SHT1_768 << ADC12_CTL0_R_SHT1_BIT)
#define ADC12_CTL0_R_SHT1_1024 (ADC12_CTL0_SHT1_1024 << ADC12_CTL0_R_SHT1_BIT)
/*-----------*/

#endif /* ADC12_PERIPHERAL_REGISTERDEFINES_HEADER_ADC12_REGISTERDEFINES_CTL0_H_ */
